# Data Analysis

In this notebook, I will be working with 3 Libraries. MatplotLib, Pandas and Numpy to try and recap on what I know about these libraries.
I will create dictionaries and convert them to dataframes using pandas then export them as csvs. Then use Matplotlib to visualize them.

In [1]:
#Imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
#Creating Numpy arrays
arr = np.array([22, 34, 25, 25, 56, 27, 78, 65])
arr2 = np.array(['Mary', 'Faith', 'Harry', 'Gilbert', 'Vanessa', 'Mucheru', 'Alice', 'Mwangi'])
arr3 = np.array([24000, 34000, 34000, 54000, 57000, 35000, 89000, 78000])

In [7]:
#Creating Dictionary using the np arrays 
Salary = {'Name': arr2,
         'Age' : arr, 
         'Salary': arr3}

In [8]:
#displaying the dictionary
Salary

{'Name': array(['Mary', 'Faith', 'Harry', 'Gilbert', 'Vanessa', 'Mucheru', 'Alice',
        'Mwangi'], dtype='<U7'),
 'Age': array([22, 34, 25, 25, 56, 27, 78, 65]),
 'Salary': array([24000, 34000, 34000, 54000, 57000, 35000, 89000, 78000])}

In [11]:
#Adding more information to the dictionary
Salary = {'Name': arr2,
         'Age' : arr, 
         'Salary': arr3,
    'Status': ['Single', 'Single', 'Married', 'Married', 'Single', 'Widowed', 'Undefined', 'Married']}

In [12]:
Salary

{'Name': array(['Mary', 'Faith', 'Harry', 'Gilbert', 'Vanessa', 'Mucheru', 'Alice',
        'Mwangi'], dtype='<U7'),
 'Age': array([22, 34, 25, 25, 56, 27, 78, 65]),
 'Salary': array([24000, 34000, 34000, 54000, 57000, 35000, 89000, 78000]),
 'Status': ['Single',
  'Single',
  'Married',
  'Married',
  'Single',
  'Widowed',
  'Undefined',
  'Married']}

In [13]:
#Converting the dictionary into a dataframe
data = pd.DataFrame(Salary)
data

      Name  Age  Salary     Status
0     Mary   22   24000     Single
1    Faith   34   34000     Single
2    Harry   25   34000    Married
3  Gilbert   25   54000    Married
4  Vanessa   56   57000     Single
5  Mucheru   27   35000    Widowed
6    Alice   78   89000  Undefined
7   Mwangi   65   78000    Married

In [14]:
data[:6]

      Name  Age  Salary   Status
0     Mary   22   24000   Single
1    Faith   34   34000   Single
2    Harry   25   34000  Married
3  Gilbert   25   54000  Married
4  Vanessa   56   57000   Single
5  Mucheru   27   35000  Widowed

In [15]:
data[1:]

      Name  Age  Salary     Status
1    Faith   34   34000     Single
2    Harry   25   34000    Married
3  Gilbert   25   54000    Married
4  Vanessa   56   57000     Single
5  Mucheru   27   35000    Widowed
6    Alice   78   89000  Undefined
7   Mwangi   65   78000    Married

In [16]:
data.std()

C:\Users\Miss Gloriah\AppData\Local\Temp\ipykernel_3512\2723740006.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.std()

Age          21.66630
Salary    23237.51585
dtype: float64

In [1]:
#assigning variables
x = data.Name()
y = data.Salary()

NameError: name 'data' is not defined